const questions = [
  // GK
  {
    q: "भारत की राजधानी क्या है?",
    options: ["दिल्ली", "मुंबई", "लखनऊ", "पटना"],
    answer: 0
  },
  {
    q: "भारत का राष्ट्रीय पशु कौन सा है?",
    options: ["शेर", "हाथी", "बाघ", "घोड़ा"],
    answer: 2
  },

  // Mathematics
  {
    q: "5 × 6 = ?",
    options: ["11", "30", "56", "60"],
    answer: 1
  },
  {
    q: "√64 का मान क्या है?",
    options: ["6", "7", "8", "9"],
    answer: 2
  },

  // Science
  {
    q: "पानी का रासायनिक सूत्र क्या है?",
    options: ["H2O", "CO2", "O2", "NaCl"],
    answer: 0
  }
];
